ГТС/УТГТС/Documents/ЗаявкаНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаТранспорт</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаТранспорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучаемыхНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаЧейСчетДоставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаЧейСчетДоставка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаСчетКомпании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКартойДистанционная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВнутр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзятоВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСклад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыЗаЧейСчетДоставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыЗаЧейСчетДоставка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетПодразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/ВодителиГТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВодителиГТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильМарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиУдостоверения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Documents/ЗаявкаНаТранспорт/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			Сообщить("Заказ: " + ДанныеЗаполнения + " должен быть проведен!");
			Возврат;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения;

		ЗапросУслуга = Новый Запрос;
		ЗапросУслуга.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Сумма, 0)) КАК Сумма
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Основание
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И (ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%доставка%"" ИЛИ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%ДОСТАВКА%""
		|	ИЛИ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%Доставка%"")
		|	И (НЕ(ЗаказКлиентаТовары.Отменено))";
		ЗапросУслуга.УстановитьПараметр("Основание", ДанныеЗаполнения);
		Результат = ЗапросУслуга.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
			//Возврат;
		Иначе
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Сумма = 0 ИЛИ Выборка.Сумма = Null Тогда
					Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
				//	Возврат;
				Иначе	
					Сумма=Выборка.Сумма;					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СУММА(ЕСТЬNULL(ЗаявкаНаТранспорт.Сумма, 0)) КАК Сумма
						|ИЗ
						|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
						|ГДЕ
						|	ЗаявкаНаТранспорт.ДокументОснование = &ДокументОснование
						|	И ЗаявкаНаТранспорт.ПометкаУдаления = ЛОЖЬ
						|
						|СГРУППИРОВАТЬ ПО
						|	ЗаявкаНаТранспорт.ДокументОснование";
					
					Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						    Сумма = Выборка.Сумма-ВыборкаДетальныеЗаписи.Сумма;
							сообщить("По данному заказу было уже заказано транспорта на " + строка(ВыборкаДетальныеЗаписи.Сумма)+ ", сумма за доставку уменьшена");
					КонецЦикла;
					
					Если Выборка.Сумма>0 Тогда
					ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента;
					//Сумма=Выборка.Сумма;
					КонецЕсли;
				КонецЕсли;	
			Иначе
				Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
				//Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.ВесЗнаменатель = 0
		|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ВесЧислитель / 1
		|		ИНАЧЕ ЗаказКлиентаТовары.Номенклатура.ВесЧислитель / ЕСТЬNULL(ЗаказКлиентаТовары.Номенклатура.ВесЗнаменатель, 1)
		|	КОНЕЦ КАК Вес,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	Номенклатура1.ОбъемЧислитель КАК ОбъемЧислитель,
		|	Номенклатура1.ОбъемЗнаменатель КАК ОбъемЗнаменатель
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|		ПО ЗаказКлиентаТовары.Номенклатура = Номенклатура1.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|	И ЗаказКлиентаТовары.Ссылка = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " нет товаров!");
			Возврат;
		КонецЕсли;	
		
		
		Менеджер = ДокументОснование.Менеджер;
		Подразделение = ДокументОснование.Подразделение;
		ПланируемаяДатаДоставки = ДокументОснование.ЖелаемаяДатаОтгрузки;
		АдресДоставки = ДокументОснование.АдресДоставки;
		Склад = ДокументОснование.Склад;
		//Меняем склад для Сервиса ГТС Подольск
		Если Склад=Справочники.Склады.НайтиПоНаименованию("Склад Сервиса - Подольск",Истина) 
			Тогда Склад=Справочники.Склады.НайтиПоНаименованию("Склад Подольск",Истина)
			Иначе
		КонецЕсли;
		Контрагент = ДокументОснование.Контрагент;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Вес=Выборка.Вес*Выборка.Количество;
			СтрокаТЧ.Объем=(Выборка.ОбъемЧислитель/?(НЕ ЗначениеЗаполнено(Выборка.ОбъемЗнаменатель),1,Выборка.ОбъемЗнаменатель)) * Выборка.КоличествоУпаковок;
			
				Запрос1 = Новый Запрос;
						Запрос1.Текст = 
							"ВЫБРАТЬ
							|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
							|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
							|ГДЕ
							|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
							|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.Наименование = ""шт""";
						
				Запрос1.УстановитьПараметр("Владелец", СтрокаТЧ.Номенклатура);
						
				РезультатЗапроса1 = Запрос1.Выполнить();
						
				ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
						
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					СтрокаТЧ.Упаковка=ВыборкаДетальныеЗаписи1.Ссылка;
					КонецЦикла;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			Сообщить("Заказ: " + ДанныеЗаполнения + " должен быть проведен!");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		|	ЗаказПоставщикуТовары.Количество,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок * ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ВесЧислитель / ВЫБОР
		|					КОГДА ЗаказПоставщикуТовары.Номенклатура.ВесЗнаменатель = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ВесЗнаменатель
		|				КОНЕЦ
		|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.Вес
		|	КОНЕЦ КАК Вес,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок,
		|	ЗаказПоставщикуТовары.Упаковка,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок * ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.Объем
		|	КОНЕЦ КАК Объем,
		|	Номенклатура1.ОбъемЧислитель,
		|	Номенклатура1.ОбъемЗнаменатель
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|		ПО ЗаказПоставщикуТовары.Номенклатура = Номенклатура1.Ссылка
		|ГДЕ
		|	ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказПоставщикуТовары.Отменено
		|	И ЗаказПоставщикуТовары.Ссылка = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " нет товаров!");
			Возврат;
		КонецЕсли;	
		
		ДокументОснование = ДанныеЗаполнения;
		
		Менеджер = ДокументОснование.Менеджер;
		Подразделение = ДокументОснование.Подразделение;
		ПланируемаяДатаДоставки = ДокументОснование.ЖелаемаяДатаПоступления;
		Склад = ДокументОснование.Склад;
		Контрагент = ДокументОснование.Контрагент;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Объем=(Выборка.ОбъемЧислитель/?(НЕ ЗначениеЗаполнено(Выборка.ОбъемЗнаменатель),1,Выборка.ОбъемЗнаменатель)) * Выборка.КоличествоУпаковок;
			
			Запрос1 = Новый Запрос;
					Запрос1.Текст = 
						"ВЫБРАТЬ
						|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
						|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
						|ГДЕ
						|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
						|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.Наименование = ""шт""";
					
			Запрос1.УстановитьПараметр("Владелец", СтрокаТЧ.Номенклатура);
					
					РезультатЗапроса1 = Запрос1.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					СтрокаТЧ.Упаковка=ВыборкаДетальныеЗаписи1.Ссылка;
					КонецЦикла;

		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ) 
	//Меняем склад для Сервиса ГТС Подольск

	Если Склад=Справочники.Склады.НайтиПоНаименованию("Склад Сервиса - Подольск",Истина) 
			Тогда Склад=Справочники.Склады.НайтиПоНаименованию("Склад Подольск",Истина)
			Иначе
			КонецЕсли;
			
	//ГТС проверяем и меняем данные в ТТН
	Если ЗначениеЗаполнено(Ссылка) и ЗначениеЗаполнено(Водитель) и Водитель<>Ссылка.Водитель Тогда
	ВодительСпр=Справочники.ВодителиГТС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВодителиГТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВодителиГТС КАК ВодителиГТС
		|ГДЕ
		|	ВодителиГТС.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВодительСпр=ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	ТранспортнаяНакладная.Ссылка КАК ТН
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
		|			ПО ТранспортнаяНакладнаяДокументыОснования.Ссылка = ТранспортнаяНакладная.Ссылка
		|		ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";
	
	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если значениезаполнено(ВодительСпр) и значениезаполнено(ВыборкаДетальныеЗаписи.ТН) тогда
		ТНОбъект=ВыборкаДетальныеЗаписи.ТН.ПолучитьОбъект();
		ТНОбъект.АдресДоставки=АдресДоставки;
		ТНОбъект.АвтомобильМарка=ВодительСпр.АвтомобильМарка;
		ТНОбъект.Водитель = ВодительСпр.Владелец;
		ТНОбъект.АвтомобильГосударственныйНомер = ВодительСпр.АвтомобильНомер;
		ТНОбъект.Перевозчик = ВодительСпр.Контрагент;
		ТНОбъект.УдостоверениеСерия = ВодительСпр.УдостоверениеСерия;
		ТНОбъект.УдостоверениеНомер = ВодительСпр.УдостоверениеНомер;
		ТНОбъект.ВидПеревозки = "Грузовая";
		ТНОбъект.БанковскийСчетПеревозчика = ВодительСпр.БанковскийСчетКонтрагента;
		ТНОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Подразделение) тогда
		Подразделение=ПараметрыСеанса.ТекущийПользователь.Подразделение;
	КонецЕсли;
КонецПроцедуры
